trade_exp/src/Documents/ЧекККМВозврат/ЧекККМВозврат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЧекККМВозврат</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.ДвижениеМаркированногоТовара</registerRecords>
  <attributes>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЧекККМ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПричинаДляОрганизации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПричинаДляОрганизацииСпр</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Покупатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КартаЛояльности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СуммаБонусныхБалловКВозврату</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КассоваяСмена</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КассаККМ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГлавныйБухгалтер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Кассир</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Магазин</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d6efd4c0-aadb-4fbc-bab2-5bb6f02a424f">
    <name>СторноОрдер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="017fb748-2a94-46b5-a01d-8eaba05eaa20">
    <name>ИсключитьИзКонтроля</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="60dd2802-f9c1-435e-923c-d459e0c47112">
    <name>ДатаПоследнегоОткрытия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a8c72a24-a385-45d4-9b74-f0036e4d090c">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e2838228-73ec-4d7e-9180-86f69e84dd8e">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d5501ee7-ab3c-46cd-b2a5-2895d1a748a2">
    <name>СуммаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="37bb3306-a9d4-4d76-ab58-8b95bdb8edf4">
    <name>ПодразделениеМенеджера</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="55fa59b5-6609-46c8-8c2e-e86b95d64bed">
    <name>ОтделМенеджера</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ХарактеристикаНабора</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НоменклатураЕГАИС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НоменклатураНабора</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Штрихкод</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>200</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Продавец</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Помещение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="285439ea-2699-4a2a-b693-b5ca7dcf27c1">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОплатаПлатежнымиКартами</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ЭквайринговыйТерминал</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ОплатаОтменена</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КодАвторизации</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>6</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СсылочныйНомер</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>НомерПлатежнойКарты</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>22</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>НомерЧекаЭТ</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>10</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>БонусныеБаллы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ДатаНачисления</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ДатаСписания</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СуммаБонусныхБаллов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>БонуснаяПрограммаЛояльности</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТипыНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>МногооборотнаяТара</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Товар</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Работа</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Набор</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Enums/СтатусыЧековККМ/СтатусыЧековККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СтатусыЧековККМ</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Пробит</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="994ecf6c-34a9-4274-952e-8a44959ddd3d">
    <name>КОплате</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="238e807a-b6d8-401c-b115-0e10b84a16c1">
    <name>ОтложенБезРезервирования</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b8d448b2-f4c4-4fef-bd83-69bf834a37d5">
    <name>ОтложенСРезервированием</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Documents/ЧекККМВозврат/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

&После ("ЗаполнитьПараметрыИнициализации")
Процедура Док_ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)
	
	Запрос.УстановитьПараметр("ЧекККМ", ДокументСсылка.ЧекККМ);
	Запрос.УстановитьПараметр("БонуснаяПрограммаЛояльности", АльтерраОбщегоНазначения.ПолучитьБонуснуюПрограмму());
	
	Если значениезаполнено(Запрос.Параметры.Склад) Тогда
		Запрос.УстановитьПараметр("ИспользоватьОрдернуюСхемуПриОтгрузке", ?((Запрос.Параметры.Склад.ИспользоватьОрдернуюСхемуПриОтгрузке И Запрос.Параметры.Склад.ДатаНачалаОрдернойСхемыПриОтгрузке <= Запрос.Параметры.Период), Истина, Ложь));
		Запрос.УстановитьПараметр("ИспользоватьОрдернуюСхемуПриПоступлении", ?((Запрос.Параметры.Склад.ИспользоватьОрдернуюСхемуПриПоступлении И Запрос.Параметры.Склад.ДатаНачалаОрдернойСхемыПриПоступлении <= Запрос.Параметры.Период), Истина, Ложь));
	Иначе
		Запрос.УстановитьПараметр("ИспользоватьОрдернуюСхемуПриОтгрузке", Ложь);
		Запрос.УстановитьПараметр("ИспользоватьОрдернуюСхемуПриПоступлении", Ложь);
	КонецЕсли;
		
КонецПроцедуры

&После("ЗарегистрироватьУчетныеМеханизмы")
Процедура Док_ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента)
	МеханизмыДокумента.Добавить("ДвижениеМаркированногоТовара");    
КонецПроцедуры
 
Функция ТекстЗапросаТаблицаДвижениеМаркированногоТовара(Запрос, ТекстыЗапроса, Регистры) экспорт
	ИмяРегистра = "ДвижениеМаркированногоТовара";
	
	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Штрихкоды.Ссылка.Дата КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	Штрихкоды.Ссылка.Склад КАК Склад,
	|	Штрихкоды.Ссылка.Организация КАК Организация,
	|	ШтрихкодыУпаковка.Ссылка КАК ШтрихкодУпаковки,
	|	Штрихкоды.АкцизнаяМарка КАК Штрихкод,
	|	1 КАК Количество
	|ИЗ
	|	Документ.ЧекККМВозврат.АкцизныеМарки КАК Штрихкоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковка
	|		ПО Штрихкоды.АкцизнаяМарка = ШтрихкодыУпаковка.Штрихкод
	|ГДЕ
	|	Штрихкоды.Ссылка = &Ссылка
	|	И ВЫБОР
	|			КОГДА Штрихкоды.Ссылка.Склад.ИспользоватьОрдернуюСхемуПриПоступлении
	|					И Штрихкоды.Ссылка.Дата >= Штрихкоды.Ссылка.Склад.ДатаНачалаОрдернойСхемыПриПоступлении
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ";	
	
  	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;

КонецФункции

&ИзменениеИКонтроль("ОтразитьРаспределениеЗапасовДвижения")
Процедура Док_ОтразитьРаспределениеЗапасовДвижения(Запрос, ТекстыЗапроса, Регистры)
	
	ТекстЗапросаТабЧасть =
		"ВЫБРАТЬ
		|	ТабЧасть.Ссылка                              КАК Ссылка,
		|	ТабЧасть.Ссылка.Дата                         КАК Период,
		|	ТабЧасть.Номенклатура                        КАК Номенклатура,
		|	ТабЧасть.Характеристика                      КАК Характеристика,
		|	ВЫБОР КОГДА ТабЧасть.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа) ТОГДА
		|				&Подразделение
		|			ИНАЧЕ
		|				ТабЧасть.Ссылка.Склад
		|		КОНЕЦ                                    КАК Склад,
		|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
		|	ТабЧасть.Количество                          КАК Количество,
		|	ЛОЖЬ                                         КАК ПоГрафику,
		|	НЕОПРЕДЕЛЕНО                                 КАК РаспоряжениеВГрафике
		|ИЗ
		|	Документ.ЧекККМВозврат.Товары КАК ТабЧасть
		|ГДЕ
		|	НЕ ТабЧасть.Ссылка.Архивный
	#Вставка
	|	И НЕ &ИспользоватьОрдернуюСхемуПриПоступлении
	#КонецВставки
		|		И ТабЧасть.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Пробит)
		|		И ТабЧасть.КоличествоУпаковок <> 0";
	
	РаспределениеЗапасовДвижения.ПриходЗапаса(Запрос, ТекстыЗапроса, Регистры, ТекстЗапросаТабЧасть, Неопределено, Ложь);
	
КонецПроцедуры


&ИзменениеИКонтроль("ОформитьОтгрузкуВРозницу")
Процедура Док_ОформитьОтгрузкуВРозницу(Запрос, ТекстыЗапроса, Регистры)

	ТекстЗапросаДанныхДокумента = 
	"ВЫБРАТЬ
	|	ТоварыДокумента.Ссылка				КАК Ссылка,
	|	ТоварыДокумента.Ссылка.Дата			КАК Период,
	|	ТоварыДокумента.Ссылка.Склад		КАК Склад,
	|	ТоварыДокумента.Помещение			КАК Помещение,
	|	ТоварыДокумента.Номенклатура		КАК Номенклатура,
	|	ТоварыДокумента.Характеристика		КАК Характеристика,
	|	ТоварыДокумента.Серия				КАК Серия,
	|	ТоварыДокумента.СтатусУказанияСерий	КАК СтатусУказанияСерий,
	|	ТоварыДокумента.Количество			КАК Количество,
	|	ИСТИНА								КАК ВозвратТовара
	|ИЗ
	|	Документ.ЧекККМВозврат.Товары КАК ТоварыДокумента
	|ГДЕ
	|	ТоварыДокумента.Ссылка В(&Ссылка)
	|	И ТоварыДокумента.Количество <> 0
	|	И НЕ ТоварыДокумента.Ссылка.Архивный 
	#Вставка
	|	И НЕ &ИспользоватьОрдернуюСхемуПриПоступлении
	#КонецВставки
	|	И ТоварыДокумента.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Пробит)";

	ОбъектМетаданных	= Метаданные.Документы.ЧекККМВозврат;

	ПараметрыМетода = СкладыСервер.ПараметрыМодульногоПроведения();
	ПараметрыМетода.ИмяТЧСерии = "Серии";
	ПараметрыМетода.СинонимТаблицыДокумента = "ТоварыДокумента";

	СкладыСервер.ОформитьОтгрузкуВРозницу(Запрос,
	ТекстыЗапроса,
	Регистры,
	ТекстЗапросаДанныхДокумента,
	ОбъектМетаданных,
	ПараметрыМетода);

КонецПроцедуры  

&Вместо("ТекстЗапросаВтБонусныеБаллы")
Функция Расш1_ТекстЗапросаВтБонусныеБаллы(Запрос, ТекстыЗапроса)

	ИмяРегистра = "ВтБонусныеБаллы";

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТабличнаяЧасть.ДатаНачисления КАК Период,
	|	ВЫБОР
	|		КОГДА ТабличнаяЧасть.ДатаСписания <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ТабличнаяЧасть.ДатаНачисления
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|	КОНЕЦ КАК ДатаНачалаДействия,
	|	&ТекущаяДата КАК ДатаКОбработке,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)КАК ВидДвижения,
	|	ТабличнаяЧасть.БонуснаяПрограммаЛояльности КАК БонуснаяПрограммаЛояльности,
	|	&Партнер КАК Партнер,
	|	ТабличнаяЧасть.СуммаБонусныхБаллов КАК Начислено,
	|	0 КАК КСписанию
	|ПОМЕСТИТЬ ВтБонусныеБаллы
	|ИЗ
	|	Документ.ЧекККМВозврат.БонусныеБаллы КАК ТабличнаяЧасть
	|ГДЕ
	|	ТабличнаяЧасть.Ссылка = &Ссылка
	|	И НЕ &Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.РозничныйПокупатель)
	|	И &ЧекПробит
	|	И НЕ &Архивный
	|	И ТабличнаяЧасть.ДатаНачисления <> ДАТАВРЕМЯ(1, 1, 1)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ЧекККМВозврат.Дата, ДЕНЬ),
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	&ТекущаяДата,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	&БонуснаяПрограммаЛояльности,
	|	&Партнер,
	|	ЧекККМВозврат.СуммаБонусныхБалловКВозврату,
	|	0
	|ИЗ
	|	Документ.ЧекККМВозврат КАК ЧекККМВозврат
	|ГДЕ
	|	ЧекККМВозврат.Ссылка = &Ссылка
	|	И НЕ &Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.РозничныйПокупатель)
	|	И &ЧекПробит
	|	И НЕ &Архивный
	|";

	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);

	Возврат ТекстЗапроса;

КонецФункции

Функция МожноСоздатьЧекВозврат(Ссылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЧекККМ.Ссылка КАК Ссылка,
		|	ЧекККМ.ПолученоНаличными КАК ПолученоНаличными
		|ИЗ
		|	Документ.ЧекККМ.ОплатаПлатежнымиКартами КАК ЧекККМОплатаПлатежнымиКартами
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЧекККМ КАК ЧекККМ
		|		ПО ЧекККМОплатаПлатежнымиКартами.Ссылка = ЧекККМ.Ссылка
		|ГДЕ
		|	ЧекККМ.ПолученоНаличными > 0
		|	И ЧекККМ.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();     
	
	Если РезультатЗапроса.Пустой() Тогда      
		Возврат Истина                  
	КонецЕсли;
		ВызватьИсключение("В чеке ККМ есть смешанная оплата. Вместо чека на возврат создайте документ ""Возврат товаров""");
    Возврат Ложь 

КонецФункции

#КонецЕсли
